{
   "allow_add_mods" : true,
   "custom_icons" : true,
   "description" : "[h1]The UNRAILED pack is here![/h1]\r\n\r\nThis pack was primarily made for Moonbo's Unrailed series that he live streamed a few times.\r\nHere are some things that were included in the mod:\r\n[list]\r\n[*] Max friction pipes\r\n[*] Creation Selector\r\n[*] Creation Spawner\r\n[*] Counter\r\n[*] Count Display\r\n[*] Tree and Rock nodes\r\n[*] Map Builder\r\n[*] Explosive launcher\r\n[*] Water block\r\n[/list]\r\n\r\n[h3]Max friction pipes[/h3]\r\nNormal pipes with 10/10 friction\r\n\r\n[h3]Creation Selector[/h3]\r\nThe Creation Selector is able to select any creation that is dynamic (not welded to the ground or on the lift) and is (at the moment), not able to handle bearings, pistons, etc. The creation will be ate in the process of selecting the creation when you interact with the selector. This is savable on the lift\r\n\r\n[h3]Creation Spawner[/h3]\r\nConnect a single Creation Selector into the Creation Spawner, and when the Creation Spawner is activated with logic, it will spawn the creation stored in the creation selector.\r\n\r\n[h3]Counter[/h3]\r\nThe counter block is a block that simply counts up when connected resources are destroyed. A logic gate can be fed into the counter block, to reduce the count by one. It will not go below zero. Counters can be daisy chained, and it is recommended to only feed a logic block into the last counter in the chain to count down. For every tick the logic gate is active, it will count down 1.\r\n\r\n[h3]Counter Display[/h3]\r\nThe counter block requires a special output to display the current count. Connect the counter to the counter display, and in the connected order, they will show the current count. The count is not in binary. From there, you can connect the counter displays to anything as a standard logic connection.\r\n\r\n[h3]Tree and Rock nodes[/h3]\r\nThe tree and rock nodes are miniature resources with a custom logic output. They can only be connected to the counter block, and when destroyed, will increment the counter block.\r\n\r\n[h3]Map Builder[/h3]\r\nThe map builder should can have up to 10 creation selectors fed into it, which are used as the available tiles for building your next map. It is recommended to use 13x13 tiles, and only use larger tiles when necessary. At any point you can exit the map builder, and manually edit the map, and return to the map builder. Be careful though, if you combine 2 tiles, they both will be deleted when you attempt to delete 1. There are on screen instructions you may follow once you are in the map builder. When you have finished building your map, it is recommended to combine tiles that are not in a square shape to square tiles by dragging blocks from one tile to the next. Then you may proceed with pressing the interact button when you are already inside of the map builder to glue the tiles together, and drop it down as a dynamic creation, savable on the lift.\r\n\r\n[h3]Explosive launcher[/h3]\r\nGoes kaboom when logic\r\n\r\n[h3]Water Block[/h3]\r\nIt water when you block",
   "fileId" : 2937036552,
   "localId" : "d7e52690-92c7-413d-b6c3-140cd8177049",
   "name" : "Unrailed Pack",
   "type" : "Blocks and Parts",
   "version" : 1
}
